# Отчёт по лабораторной работе №14 по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Халимов Исмоилджон Ибрагимджонович, № по списку 22</ins> 

<b>Контакты e-mail:</b> <ins>lirikfeed049@gmail.com</ins>

<b>Работа выполнена:</b> «27» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins></ins>

<b>Отчет сдан</b>  <ins></ins>  <ins> </ins> 2022 г., <b>итоговая оценка</b>  <ins></ins>

<b>Подпись преподавателя:</b> ________________


# 1. Тема
Вложенные циклы с параметрами. Обход и линеаризация матриц
## 2. Цель работы
Составить программу на языке Си, выполняющую ввод квадратной матрицы и печати в строку всех её элементов в порядке, заданном ниже
## 3. Задание (вариант № 21)
| 1 | 2 | 3 | 4 |
| -- | --- | --- | --- |
| 12 | 13 | 14 | 5 |
| 11 | 16 | 15 | 6 |
| 10 | 9 | 8 | 7 |
## 4. Оборудование
<b>Процессор:</b> AMD Ryzen 5 3500U (8) @ 2.10GHz<br/>
<b>ОП:</b> 6940MiB<br/>
<b>Текстовый редактор:</b> Visual Studio Code <br/>
## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 10 Home <br/>
<b>Компилятор:</b> GNU Compiler Collection <br/>
<b>Текстовый редактор:</b> Visual Studio Code <br/>
## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)

• Разобраться с поставленной задачей

• Найти решение с помощью программы на языке С

•	Скомпилировать программу

•	Запустить программу

•   Сделать анализ ошибок


## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
``` c:14.c
// Лабораторная работа номер 14
// Студент: Халимов Исмоилджон Ибрагимджонович (М8О-108Б-22)
#include <stdio.h>

enum { maxn = 100 };

int main(){
    int m[maxn][maxn];
    int n;
    scanf("%d", &n);
    for (int i = 0; i != n; ++i)
        for (int j = 0; j != n; ++j)
            scanf("%d", &m[i][j]);
    int first_stop = n - 1;
    int second_stop = 0;
    int i = 0, j = 0;
    printf("%d\n", m[i][j]);
    for (int k = 0; k < (n / 2) + 1; ++k){
        while (j < first_stop){
            ++j;  
            printf("%d\n", m[i][j]);  
        }
        while (i < first_stop) {
            ++i;
            printf("%d\n", m[i][j]);
        }
        while (j > second_stop) {
            j -= 1;
            printf("%d\n", m[i][j]);
        }
        while (i > (second_stop + 1)) {
            i -= 1;
            printf("%d\n", m[i][j]);
        }
        first_stop -= 1;
        ++second_stop;
    }

    putchar('\n');
    return 0;
}  
                                 

```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя:</b> ________________
## 8. Распечатка протокола 
```
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> gcc -Wall -pedantic -std=c99 -g 14.c -o 14.exe
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> ./14.exe
2
1 2
4 3
1
2
3
4
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> ./14.exe
3
1 2 3
8 9 4
7 6 5
1
2
3
4
5
6
7
8
9
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб>

```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 27.11.22 | 16:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
Защита была проведена без замечаний.
## 11. Выводы
Была написана программа для практики работы с анализирующими и обрабатывающими входными данными.


<b>Подпись студента:</b> ____________________


