# Отчёт по лабораторной работе №13 по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Халимов Исмоилджон Ибрагимджонович, № по списку 22</ins> 

<b>Контакты e-mail:</b> <ins>lirikfeed049@gmail.com</ins>

<b>Работа выполнена:</b> «27» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins></ins>

<b>Отчет сдан</b>  <ins></ins>  <ins> </ins> 2022 г., <b>итоговая оценка</b>  <ins></ins>

<b>Подпись преподавателя:</b> ________________


# 1. Тема
Множетсва.
## 2. Цель работы
Составить программу на языке Си, которая работает с обработкой вводимого текста и работающего без ограничений на количество и длину строк исходного текста.
## 3. Задание (вариант № 21)
Есть ли слово, содержащее ровно одну гласную.
## 4. Оборудование
<b>Процессор:</b> AMD Ryzen 5 3500U (8) @ 2.10GHz<br/>
<b>ОП:</b> 6940MiB<br/>
<b>Текстовый редактор:</b> Visual Studio Code <br/>
## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 10 Home <br/>
<b>Компилятор:</b> GNU Compiler Collection <br/>
<b>Текстовый редактор:</b> Visual Studio Code <br/>
## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)

• Разобраться с поставленной задачей

• Найти решение с помощью программы на языке С

•	Скомпилировать программу

•	Запустить программу

•   Сделать анализ ошибок


## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
Тесты:

Ввод:
My Name is Lise
Вывод:
YES

Ввод:
Scientists should study without weekends
Вывод:
NO

Ввод:
jfjjfjejfjf
Вывод:
YES

``` c:13.c
// Лабораторная работа номер 13
// Студент: Халимов Исмоилджон Ибрагимджонович (М8О-108Б-22)
#include <stdio.h>
#include <ctype.h>

#define VOWELS (1u << ('a' - 'a') | 1u << ('e' - 'a') | 1u << ('i' - 'a') | 1u << ('o' - 'a') |\
1u << ('u' - 'a') | 1u << ('y' - 'a'))

typedef unsigned int uint;

uint char_to_set(int ch){
    ch = tolower(ch);
    if (isalpha(ch)){
        return (1u << (ch - 'a'));
    } else{
        return 0;
    }
}

typedef enum{
    ONE_VOWEL_IN_WORD,
    NO_VOWEL_IN_WORD,
    WRONG_WORD
} state;

int main(){
    state state = NO_VOWEL_IN_WORD;
    int counter = 0;
    for (int c = getchar(); c != EOF; c = getchar()){
        if ((c == ' ') || (c == '\n') || (c == ',')){
            if (state == ONE_VOWEL_IN_WORD){
                counter++;
            }
            state = NO_VOWEL_IN_WORD;
        } else{
            if (state == NO_VOWEL_IN_WORD){
                if ((char_to_set(c) & VOWELS) != 0){
                    state = ONE_VOWEL_IN_WORD;
                }
            } else if ((state == ONE_VOWEL_IN_WORD) && ((char_to_set(c) & VOWELS) != 0)){
                    state = WRONG_WORD;
                }
        }
    }
    if (counter > 0){
        printf("YES\n");
    } else{
        printf("NO\n");
    }
    return 0;
}

```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя:</b> ________________
## 8. Распечатка протокола 
```
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> gcc -Wall -pedantic -std=c99 -g 13.c -o 13.exe
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> Get-Content 13_input.txt | ./13.exe
YES
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> Get-Content 13_input.txt | ./13.exe
NO
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб>

```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 27.11.22 | 16:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
Защита была проведена без замечаний.
## 11. Выводы
Была написана программа для практики работы с анализирующими и обрабатывающими входными данными.


<b>Подпись студента:</b> ____________________


