# Отчёт по лабораторной работе №15 по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Халимов Исмоилджон Ибрагимджонович, № по списку 22</ins> 

<b>Контакты e-mail:</b> <ins>lirikfeed049@gmail.com</ins>

<b>Работа выполнена:</b> «27» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins></ins>

<b>Отчет сдан</b>  <ins></ins>  <ins> </ins> 2022 г., <b>итоговая оценка</b>  <ins></ins>

<b>Подпись преподавателя:</b> ________________


# 1. Тема
Обработка матриц
## 2. Цель работы
Составить программу на языке Си, выполняющую обработку матрицы размером N * N из целых чисел 
## 3. Задание (вариант № 21)
Перестановка в обратном порядке элементов столбца, содержащего максимальный элемент матрицы.
## 4. Оборудование
<b>Процессор:</b> AMD Ryzen 5 3500U (8) @ 2.10GHz<br/>
<b>ОП:</b> 6940MiB<br/>
<b>Текстовый редактор:</b> Visual Studio Code <br/>
## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 10 Home <br/>
<b>Компилятор:</b> GNU Compiler Collection <br/>
<b>Текстовый редактор:</b> Visual Studio Code <br/>
## 6. Идея, метод, алгоритм
1. Будем считывать число n (размерность матрицы), пока не считаем конец файла. 
2. Зададим значения переменным max и min INT_MIN и INT_MAX соответственно.
4. Находим сумму элементов каждого столбца. Сравниваем эту сумму с max. Если сумма больше max, то приравниваем max к сумме. 
5. Меняем местами значения из столбца max_column.


## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
Ввод:    
4    
| 1 | 2 | 3 | 4 | 
| -- | -- | -- | -- |
| 5 | 6 | 7 | 8 | 
| 9 | 10 | 11 | 12 |
| 13 | 14 | 15 | 16 |    

Ввывод:    
| 1 | 2 | 3 | 16 | 
| -- | -- | -- | -- |
| 5 | 6 | 7 | 12 | 
| 9 | 10 | 11 | 8 |
| 13 | 14 | 15 | 4 | 

Ввод:    
3
| 1 | 2 | 3 |
| -- | -- | -- |
| 4 | 5 | 6 | 
| 7 | 8 | 9 | 

Ввывод:    
| 1 | 2 | 9 |
| -- | -- | -- |
| 4 | 5 | 6 |
| 7 | 8 | 3 |

Ввод:    
3
| 1 | 2 |
| -- | -- |
| 3 | 4 |

Ввывод:    
| 1 | 4 |
| -- | -- |
| 3 | 2 | 


``` c:15.c
// Лабораторная работа номер 15
// Студент: Халимов Исмоилджон Ибрагимджонович (М8О-108Б-22)
#include <stdio.h>
#include <limits.h>
enum { maxn = 10 };
void matrix_input(int n, int (*m)[n]);
void matrix_output(int n, int (*m)[n]);
void matrix_shuffle(int n, int(*m)[n]);

int main(){
    int m[maxn * maxn];
    int n;
    scanf("%d", &n);
    matrix_input(n, (int (*)[n]) m);         
    matrix_shuffle(n, (int (*)[n]) m);
    matrix_output(n, (int (*)[n]) m); 
    return 0;
}
void matrix_input(int n, int (*m)[n]){
    for (int i = 0; i < n; ++i){
        for (int j = 0; j < n; ++j){
            scanf("%d", &m[i][j]);
        }
    }
}
void matrix_output(int n, int (*m)[n]){
    for (int i = 0; i != n; ++i){
        for (int j = 0; j != n; ++j){
            printf("%d ", m[i][j]);
        }
        printf("\n");
     }
}

void matrix_shuffle(int n, int(*m)[n]){
    int sum = 0, max = INT_MIN, max_column = 0;
    for (int j = 0; j != n; ++j){
        sum = 0;
        for (int i = 0; i != n; ++i){
            sum = m[i][j];
            if (max < sum){
                max = sum;
                max_column = j;
            }
        }

    }
    int dop_m = 0;
    for (int i = 0; i < (n/2); ++i) {
        dop_m = m[n-i-1][max_column];
        m[n-i-1][max_column] = m[i][max_column];
        m[i][max_column] = dop_m;
        
    }

}
                                 

```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя:</b> ________________
## 8. Распечатка протокола 
```
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> gcc -Wall -pedantic -std=c99 -g 15.c -o 15.exe
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> ./15.exe
2
1 2
3 4
1 4
3 2
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> ./15.exe
3
1 2 3
4 5 6
7 8 9
1 2 9
4 5 6
7 8 3
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб> ./15.exe
2
4 1
2 3
2 1 
4 3
PS C:\Users\lirik\OneDrive\Рабочий стол\Лаб>

```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 27.11.22 | 16:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
Защита была проведена без замечаний.
## 11. Выводы
Была написана программа для практики работы с анализирующими и обрабатывающими входными данными.


<b>Подпись студента:</b> ____________________


